[M_CustomerService MissionDefinition]
TurnInDescription="You retrieved Marcus's refund checks, keeping his profit margin in its usual place. Marcus's lack-of-a-conscience will rest easy tonight."
MissionSummary="Retrieve Marcus's refund checks in the allotted time. "
